In [5]:
import pandas as pd
import sys

In [6]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]
Pandas version 1.2.4

In [7]:
# Create DataFrame
d = [1,2,3,4,5,6,7,8,9]
df = pd.DataFrame(d, columns = ['Number'])
df

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [8]:
# Export to Excel
df.to_excel('Lesson10.xlsx', sheet_name = 'testing', index = False)
print('Done')

Done

In [9]:
# Path to excel file
# Your path will be different, please modify the path below.
location = r'C:\Users\farhan.khalid\Downloads\Pandas Training\Lesson10.xlsx'

# Parse the excel file
df = pd.read_excel(location, 0)
df.head()

   Number
0       1
1       2
2       3
3       4
4       5

In [16]:
import os
os.remove(location)

In [10]:
df.dtypes

Number    int64
dtype: object

In [11]:
df.tail()

   Number
4       5
5       6
6       7
7       8
8       9

In [12]:
df.to_json('Lesson10.json')
print('Done')

Done

In [13]:
# Your path will be different, please modify the path below.
jsonloc = r'C:\Users\farhan.khalid\Downloads\Pandas Training\Lesson10.json'

# read json file
df2 = pd.read_json(jsonloc)

In [14]:
df2

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [15]:
df2.dtypes

Number    int64
dtype: object